In [1]:
# Pandas - DataFrame And Series

"""Panda is a powerful data manipulation library in python, widely used for data analysis and data cleaning.It
provides two primary data structures.Series and DataFrame. A series is a one dimensional array-like object,
while a DataFrame is a two dimentional,size-mutable,potentially heterogeneous tabular data structure
with labled axes(rows and colums)"""

'Panda is a powerful data manipulation library in python, widely used for data analysis and data cleaning.It\nprovides two primary data structures.Series and DataFrame. A series is a one dimensional array-like object,\nwhile a DataFrame is a two dimentional,size-mutable,potentially heterogeneous tabular data structure\nwith labled axes(rows and colums)'

In [7]:
import pandas as pd

In [9]:
## A Pandas Series is a one-dimensional array like object that can hold any data type. 
## It is similar to column in a table

import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
series = pd.Series(data)
print("Series \n",series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
## Create a series from dictionary

data = { 'a':1 , 'b':2 , 'c':3 }
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [13]:
data = [10,20,30]
index=['a','b','c']
print(pd.Series(data,index=index))

a    10
b    20
c    30
dtype: int64

In [25]:
## DataFrame
## Create a Dataframe from a dictionary of list

data = {
    'Name' : ['Dulana','He he','he he 2'],
    'age'  : [28,30,32],
    'City' : ['Bangalore','New york','Florida']
}

df = pd.DataFrame(data)
print(df)
print(type(df))
df

      Name  age       City
0   Dulana   28  Bangalore
1    He he   30   New york
2  he he 2   32    Florida
<class 'pandas.core.frame.DataFrame'>

      Name  age       City
0   Dulana   28  Bangalore
1    He he   30   New york
2  he he 2   32    Florida

In [17]:
import numpy as np
print(np.array(df))

[['Dulana' 28 'Bangalore']
 ['He he' 30 'New york']
 ['he he 2' 32 'Florida']]

In [18]:
## Create a Data Drame from a List of Dictionaries
data = [
    {'Name':'Dulana','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':28,'City':'Canda'},
    {'Name':'He he','Age':30,'City':'Florida'}
]

In [19]:
df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  Dulana   32  Bangalore
1    John   28      Canda
2   He he   30    Florida
<class 'pandas.core.frame.DataFrame'>

In [21]:
df=pd.read_csv('/Users/nethsarani/Desktop/Dulana/Python-for-MLOps/sales_data.csv')

In [22]:
df.head(6)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
5,10006,2024-01-06,Sports,Wilson Evolution Basketball,5,29.99,149.95,Asia,Credit Card

In [23]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [33]:
data = {
    'Name' : ['Dulana','He he','he he 2'],
    'age'  : [28,30,32],
    'City' : ['Bangalore','New york','Florida']
}

In [26]:
data

{'Name': ['Dulana', 'He he', 'he he 2'],
 'age': [28, 30, 32],
 'City': ['Bangalore', 'New york', 'Florida']}

In [27]:
df['Name']

0     Dulana
1      He he
2    he he 2
Name: Name, dtype: object

In [28]:
type(df['Name'])

pandas.core.series.Series

In [ ]:
df.loc[0] #row

Name       Dulana
age            28
City    Bangalore
Name: 0, dtype: object

In [34]:
df

      Name  age       City
0   Dulana   28  Bangalore
1    He he   30   New york
2  he he 2   32    Florida

In [37]:
## Accessing a specified element
print(df.at[1,'age'])

30

In [38]:
df.at[2,'Name']

'he he 2'

In [41]:
## Accessing a specified element using a iat
df.iat[2,2]

'Florida'

In [42]:
## Adding a column
df['Salary']=[50000,60000,70000]

In [ ]:
## Remove a column
df.drop("Salary",axis=1,inplace=True) # inplace=True do it permenantly

      Name  age       City
0   Dulana   28  Bangalore
1    He he   30   New york
2  he he 2   32    Florida

In [48]:
## Data Manipulation with data frame
df

      Name  age       City  Salary
0   Dulana   28  Bangalore   50000
1    He he   30   New york   60000
2  he he 2   32    Florida   70000

In [49]:
df.drop("Salary",axis=1,inplace=True) # inplace=True do it permenantly

In [50]:
df

      Name  age       City
0   Dulana   28  Bangalore
1    He he   30   New york
2  he he 2   32    Florida

In [56]:
## Add age to the column
df['age'] = df['age']+1
df

      Name  age       City
0   Dulana   36  Bangalore
1    He he   38   New york
2  he he 2   40    Florida

In [ ]:
df.drop(0,inplace=True)

KeyError: '[0] not found in axis'

In [60]:
df

      Name  age      City
1    He he   38  New york
2  he he 2   40   Florida

In [62]:
# Display the data types of each column
print("Data types:\n",df.dtypes)

# Display the DataFrame
print("Statistical summary:\n",df.describe())

#Group by a column and perform an aggregation

Data types:
 Name    object
age      int64
City    object
dtype: object
Statistical summary:
              age
count   2.000000
mean   39.000000
std     1.414214
min    38.000000
25%    38.500000
50%    39.000000
75%    39.500000
max    40.000000

In [63]:
df.describe()

             age
count   2.000000
mean   39.000000
std     1.414214
min    38.000000
25%    38.500000
50%    39.000000
75%    39.500000
max    40.000000